clase_34/RecursosBackend-Artillery/config.yml
config:
  plugins:
    metrics-by-endpoint: {}
  target: 'http://localhost:8080'
  phases:
    - duration: 20
      arrivalRate: 10
scenarios:
  - name: "Sessions Flow (register + login)"
    flow:
      - log: "Creating variables for user" # Vamos a dar una 
      - get:
          url: '/api/test/user'
          capture:
            - json: "$.first_name"
              as: "first_name"
            - json: "$.last_name"
              as: "last_name"
            - json: "$.email"
              as: "email"
            - json: "$.password"
              as: "password"
      - log: "Registering user"
      - post:
          url: "/api/sessions/register"
          json: #Vamos a recibir las variables de nuestro script generador de usuarios
            first_name: "{{ first_name }}"
            last_name: "{{ last_name }}"
            email: "{{ email }}"
            password: "{{ password }}"
      - think: 2
      - log: "Login user"
      - post:
          url: "/api/sessions/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"